Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: `fmt` or `format`: format the string instance via `java.lang.String.format()`
ja_jp: `fmt` または `format`: `java.lang.String.format()` によって文字列のインスタンスをフォーマットします。

source: `foo.BAR.baz` - Exact match
ja_jp: `foo.BAR.baz` - 完全一致

source: `foo_BAR_baz` - Replace each character that is neither alphanumeric nor `\_` with `_`
ja_jp: `foo_BAR_baz` - 英数字でもなく、 `_` でもない各文字を、 `_` で置換

source: `for` Iteration Metadata Example
ja_jp: `for` イテレーションのメタデータの例

source: `format(pattern)`: Formats temporal objects from the `java.time` package
ja_jp: `format(pattern)` : `java.time` パッケージの一時オブジェクトをフォーマットします。

source: `format(pattern,locale)`: Formats temporal objects from the `java.time` package
ja_jp: `format(pattern,locale)` : `java.time` パッケージの一時オブジェクトをフォーマットします。

source: `format(pattern,locale,timeZone)`: Formats temporal objects from the `java.time` package
ja_jp: `format(pattern,locale,timeZone)` : `java.time` パッケージの一時オブジェクトをフォーマットします。

source: `fr-CA.js` — Canada-specific
ja_jp: `fr-CA.js` — カナダ固有

source: `fr-FR.js` — France-specific
ja_jp: `fr-FR.js` — フランス固有

source: `fr.js` — base French
ja_jp: `fr.js` — ベースフランス語

source: `from EntityName ...` which will expand to `delete from EntityName ...`
ja_jp: `from EntityName …​` は `delete from EntityName ...` に展開されます

source: `from EntityName ...` which will expand to `update EntityName ...`
ja_jp: from EntityName ...` は `update EntityName ...` に展開されます

source: `from EntityName ...` which will expand to `update from EntityName ...`
ja_jp: `from EntityName ...` は `update from EntityName ...` に展開されます

source: `function.zip` - lambda deployment file
ja_jp: `function.zip` - Lambda デプロイファイル

source: `function` - Use the default which is `quarkus`. Name of your azure function. Can be anything you want.
ja_jp: `function` - デフォルトの `quarkus` を使用してください。あなたの azure 関数の名前。何でも構いません。

source: `generate-extensions-json` is the goal generating the platform descriptor
ja_jp: `generate-extensions-json` は、プラットフォームディスクリプタを生成するゴールです。

source: `get(index)`: Returns the element at the specified position in a list
ja_jp: `get(index)` : リストの指定した位置の要素を返す

source: `get(key)`: Returns the value to which the specified key is mapped
ja_jp: `get(key)` : 指定したキーがマッピングされた値を返します。

source: `getMachineFactory()`: returns the appropriate `MachineFactory` based on environment (interpreter for dev, build-time compilation for production/native)
ja_jp: `getMachineFactory()`: 環境に基づいた適切な `MachineFactory` を返します (開発時はインタープリター、本番/ネイティブ時はビルド時コンパイル)。

source: `getWasmModule()`: returns the parsed WebAssembly module
ja_jp: `getWasmModule()`: 解析された WebAssembly モジュールを返します。

source: `getting-started-1.0.0-SNAPSHOT.jar` - containing just the classes and resources of the projects, it's the regular artifact produced by the Maven build - it is *not* the runnable jar;
ja_jp: `getting-started-1.0.0-SNAPSHOT.jar`: プロジェクトのクラスとリソースだけを含み、Maven ビルドによって生成される通常のアーティファクトです。

source: `global` for global configuration
ja_jp: `global`: グローバル設定

source: `groupId1:artifactId1,groupId2:artifactId2` - scan only the dependencies with group id and artifact id in the list.
ja_jp: `groupId1:artifactId1,groupId2:artifactId2` - リスト内のグループIDとアーティファクトIDを持つ依存関係のみをスキャンする

source: `groupId1:artifactId1,groupId2:artifactId2` - scan only the specified dependencies by group ID and artifact ID.
ja_jp: `groupId1:artifactId1,groupId2:artifactId2` - グループ ID とアーティファクト ID で指定された依存関係のみをスキャンします。

source: `groupId` - The maven groupId of this generated project. Type in `org.acme`.
ja_jp: `groupId` - この生成されたプロジェクトの maven グループ ID。 `org.acme` と入力します。

source: `guide`: URL to the extension's guide; used to render the guide icon on the card.
ja_jp: `guide`: エクステンションのガイドへの URL。カード上のガイドアイコンのレンダリングに使用されます。

source: `halCollectionName` - name that should be used when generating a hal collection response. Default name is a hyphenated lowercase resource name without a suffix of `resource` or `controller`.
ja_jp: `halCollectionName` - HAL コレクションレスポンスを生成する際に使用されるべき名前です。デフォルトの名前は `resource` または `controller` のサフィックスなしのハイフン付き小文字のリソース名です。

source: `hal` - in addition to the standard `application/json` responses, generates additional methods that can return `application/hal+json` responses if requested via an `Accept` header. Default is `false`.
ja_jp: `hal` - 標準の `application/json` レスポンスに加えて、 `Accept` ヘッダでリクエストされた場合に `application/hal+json` レスポンスを返す追加のメソッドを生成します。デフォルトは `false` です。

source: `hasJWT` is `false`.
ja_jp: `hasJWT` は `false` です。

source: `hasNext` - `true` if the iteration has more elements
ja_jp: `hasNext` - イテレーションにさらに要素がある場合は `true` とります。

source: `health-ui` allows you to see your Health Checks in a Web GUI.
ja_jp: `health-ui` はヘルスチェックの内容をWeb GUIで確認することができます。

source: `health-ui` can be accessed from http://localhost:8080/q/health-ui/ .
ja_jp: `health-ui` は、 http://localhost:8080/q/health-ui/ からアクセスできます。

source: `hello.Greeter` is the generated service interface.
ja_jp: `hello.Greeter` は、生成されたサービスインターフェースです。

source: `hello_name` is the message key.
ja_jp: `hello_name` がメッセージキーです。

source: `hello` is the java package for the generated classes.
ja_jp: `hello` は、生成されたクラスのjavaパッケージです。

source: `hello` is the name used in the `@GrpcClient` annotation.
ja_jp: `hello` は `@GrpcClient` アノテーションで使用される名前です。

source: `highestPrimeNumberSoFar`: A gauge that stores the highest number asked about by the user if the number was determined to be prime.
ja_jp: `highestPrimeNumberSoFar`: 素数と判定された場合に、ユーザーから質問された最高値を格納するゲージ。

source: `highestPrimeNumberSoFar`: A gauge that stores the highest number that was asked about by the user and which was determined to be prime.
ja_jp: `highestPrimeNumberSoFar`: ユーザーが問い合わせし、素数であると判断された最高値を格納するゲージ。

source: `host` configures the service host (here it's localhost).
ja_jp: `host` はサービスホストを設定します (ここでは localhost)。

source: `iat` (issued at): Current time
ja_jp: `iat` (発行時刻): 現在の時刻

source: `if` is a basic control flow section.
ja_jp: `if` は、基本的な制御フローのセクションです。

source: `ignore` performs no commit. This strategy is the default strategy when the consumer is explicitly configured with `enable.auto.commit` to true. It delegates the offset commit to the underlying Kafka client. When `enable.auto.commit` is `true` this strategy **DOES NOT** guarantee at-least-once delivery. SmallRye Reactive Messaging processes records asynchronously, so offsets may be committed for records that have been polled but not yet processed. In case of a failure, only records that were not committed yet will be re-processed.
ja_jp: `ignore` はコミットを実行しません。このストラテジーは、コンシューマーが `enable.auto.commit` を true に明示的に設定されている場合のデフォルトのストラテジーです。これは、オフセットコミットを基盤となる Kafka クライアントに委任します。 `enable.auto.commit` が `true` の場合、このストラテジーは少なくとも 1 回の配信を**保証しません**。SmallRye Reactive Messaging はレコードを非同期で処理するため、ポーリングされたがまだ処理されていないレコードに対してオフセットがコミットされる場合があります。エラーが発生した場合、まだコミットされていないレコードのみが再処理されます。

source: `ignore` the failure is logged, but the acknowledgement strategy will be applied and the processing will continue.
ja_jp: `ignore` の場合、失敗がログに記録されますが、確認応答ストラテジーが適用され、処理が続行されます。

source: `ignore`: the failure is logged, but the processing continue. The offset of the record that has not been processed correctly is committed.
ja_jp: `ignore`: エラーはログに記録されますが、処理は続行されます。正しく処理されなかったレコードのオフセットがコミットされます。

source: `include` section is used to specify the extended template.
ja_jp: `include` セクションは、拡張テンプレートを指定するために使用されます。

source: `incrby` - allows setting the increment value (positive or negative)
ja_jp: `incrby`: 増分値 (正または負) を設定することができます。

source: `incrbyfloat` - allows setting the increment value as a float/ double (the stored value will be a double)
ja_jp: `incrbyfloat` - float/double として増分値を設定できます (格納される値は double になります)。

source: `indexParity` - outputs `odd` or `even` based on the count value
ja_jp: `indexParity` - は、カウント値に応じて `odd` または `even` を出力します

source: `indexParity` - outputs `odd` or `even` based on the zero-based index value
ja_jp: `indexParity` - ゼロ基準のインデックス値に基づいて、 `odd` または `even` を出力します。

source: `index` - zero-based index
ja_jp: `index` - ゼロ基準のインデックス

source: `insert` sections are used to specify parts that could be overridden by a template that includes the given template.
ja_jp: `insert` セクションは、指定されたテンプレートをインクルードするテンプレートでオーバーライドできるパーツを指定するために使われます。

source: `int` and `java.lang.Integer`
ja_jp: `int` および `java.lang.Integer`

source: `integration-tests`: Generates during integration tests execution (better optimization). For Leyden AOT, this has the same effect as `auto`
ja_jp: `integration-tests`: 統合テストの実行中に生成します (より高度な最適化)。Leyden AOT の場合、これは `auto` と同じ効果を持ちます。

source: `interceptor.classes` accept a list of classes separated by a comma.
ja_jp: `interceptor.classes` はカンマで区切られたクラスのリストを受け付けます。

source: `invokevirtual` of `getMyself()` that returns `GHMyself`
ja_jp: `GHMyself` を返す`getMyself()` の `invokevirtual`

source: `io.quarkus.analytics.localconfig` holds if the user has agreed to send analytics data or not.
ja_jp: `io.quarkus.analytics.localconfig` は、ユーザーが分析データの送信に同意したかどうかを保持します。

source: `io.quarkus.analytics.remoteconfig` cache of the remote configuration that allows to disable analytics globally.
ja_jp: `io.quarkus.analytics.remoteconfig` リモート・コンフィギュレーションのキャッシュで、アナリティクスをグローバルに無効にできます。

source: `io.quarkus.arc.Lock` is a regular interceptor binding and as such can be used for any bean with any scope. However, it is especially useful for "shared" scopes, e.g. `@Singleton` and `@ApplicationScoped`.
ja_jp: `io.quarkus.arc.Lock` は通常のインターセプターバインディングであるため、任意のスコープを持つ任意の Bean に使用することができます。しかし、特に「共有」スコープ、たとえば `@Singleton` や `@ApplicationScoped` に有益です。

source: `io.quarkus.arc.deployment.GeneratedBeanGizmoAdaptor` makes it easy to produce ``GeneratedBeanBuildItem``s from Gizmo constructs.
ja_jp: `io.quarkus.arc.deployment.GeneratedBeanGizmoAdaptor` を使用すると、Gizmo コンストラクトから ``GeneratedBeanBuildItem`` を簡単に作成できます。

source: `io.quarkus.builder.item.MultiBuildItem` if you want to have multiple instances (e.g. `ServletBuildItem`, you can produce many Servlets during the deployment).
ja_jp: 複数のインスタンスを使いたい場合は `io.quarkus.builder.item.MultiBuildItem` (例: `ServletBuildItem`、デプロイ時に多くのサーブレットを生成することができます)。

source: `io.quarkus.builder.item.SimpleBuildItem` if you need only a single instance of the item during the deployment (e.g. `BeanContainerBuildItem`, you only want one container).
ja_jp: `io.quarkus.builder.item.SimpleBuildItem` デプロイ時にアイテムのインスタンスを1つだけ必要とする場合 (例: `BeanContainerBuildItem`、コンテナーが 1 つのみ必要な場合)。

source: `io.quarkus.cache.CacheName` can be used on a field, a constructor parameter or a method parameter to inject a `Cache`:
ja_jp: `io.quarkus.cache.CacheName` は、フィールド、コンストラクタパラメータ、またはメソッドのパラメータに使用して、 `Cache` をインジェクトすることができます。

source: `io.quarkus.deployment.builditem.FeatureBuildItem` is an implementation of `BuildItem` which represents the description of an extension. This `BuildItem` will be used by Quarkus to display information to the users when the application is starting.
ja_jp: `io.quarkus.deployment.builditem.FeatureBuildItem` は、エクステンションの説明を表す `BuildItem` の実装です。この `BuildItem` は、アプリケーションの起動時にユーザーに情報を表示するために Quarkus が使用します。

source: `io.quarkus.deployment.recording.RecorderContext` provides some convenience methods to enhance bytecode recording, this includes the ability to register creation functions for classes without no-arg constructors, to register an object substitution (basically a transformer from a non-serializable object to a serializable one and vice versa), and to create a class proxy. This interface can be directly injected as a method parameter into any `@Record` method.
ja_jp: `io.quarkus.deployment.recording.RecorderContext` は、バイトコードの記録を強化するためのいくつかの便利なメソッドを提供しています。これには、引数なしのコンストラクタを持たないクラスの作成関数の登録、オブジェクト置換の登録（基本的には、シリアル化不可能なオブジェクトからシリアル化可能なオブジェクトへの変換、およびその逆）、クラスプロキシの作成などがあります。このインターフェースは、 `@Record` のメソッドにメソッドパラメータとして直接注入することができます。

source: `io.quarkus.logging.Log` depends on Quarkus bytecode transformations that occur at build time.
ja_jp: `io.quarkus.logging.Log` は、ビルド時に発生する Quarkus バイトコード変換に依存します。

source: `io.quarkus.mailer.Mailer` provides the imperative (blocking and synchronous) API;
ja_jp: `io.quarkus.mailer.Mailer` は、命令型(ブロッキング、同期)APIを提供しています。

source: `io.quarkus.mailer.ReactiveMailer` is deprecated in favor of `io.quarkus.mailer.reactive.ReactiveMailer`.
ja_jp: `io.quarkus.mailer.ReactiveMailer` は、 `io.quarkus.mailer.reactive.ReactiveMailer` に置き換えられ非推奨となりました。

source: `io.quarkus.mailer.reactive.ReactiveMailer` provides the reactive (non-blocking and asynchronous) API
ja_jp: `io.quarkus.mailer.reactive.ReactiveMailer` は、リアクティブ（ノンブロッキング、非同期）なAPIを提供しています。

source: `io.quarkus.oidc.OidcSession` is a wrapper around the current `IdToken`, which can help to perform a <<local-logout,Local logout>>, retrieve the current session's tenant identifier, and check when the session will expire. More useful methods will be added to it over time.
ja_jp: `io.quarkus.oidc.OidcSession` は現在の `IdToken` のラッパーで、<<local-logout,Local logout>> の実行、現行セッションのテナント識別子の取得、セッションの有効期限の確認を行う上で役に立ちます。 今後、より便利なメソッドが追加される予定です。

source: `io.quarkus.oidc.OidcSession` is a wrapper around the current `IdToken`. It can help to perform a <<local-logout, Local Logout>>, retrieve the current session's tenant identifier and check when the session will expire. More useful methods will be added to it over time.
ja_jp: `io.quarkus.oidc.OidcSession` は、現在の `IdToken` のラッパーのようなものです。 <<local-logout, ローカルログアウト>> を実行したり、現在のセッションのテナント識別子を取得したり、セッションの有効期限を確認したりすることができます。今後、より便利なメソッドが追加される予定です。

source: `io.quarkus.oidc.Tenant` annotation is checked first if the proactive authentication is disabled.
ja_jp: プロアクティブ認証が無効になっている場合は、最初に `io.quarkus.oidc.Tenant` アノテーションがチェックされます。

source: `io.quarkus.oidc.client.OidcClients` is a container of `OidcClient` instances.
ja_jp: `io.quarkus.oidc.client.OidcClients` は `OidcClient` インスタンスのコンテナーです。

source: `io.quarkus.oidc.client.OidcClients` is a container of ``OidcClient``s - it includes a default `OidcClient` and named clients which can be configured like this:
ja_jp: `io.quarkus.oidc.client.OidcClients` は、 ``OidcClient``s のコンテナーです。デフォルトの `OidcClient` と名前付きクライアントを含み、以下のように設定することができます。

source: `io.quarkus.oidc.client.registration.RegisteredClient` represents a registered client and can be used to read and update its metadata. It can also be used to delete this client.
ja_jp: `io.quarkus.oidc.client.registration.RegisteredClient` は登録されたクライアントを表し、そのメタデータの読み取りと更新に使用できます。 このクライアントを削除する場合にも使用できます。

source: `io.quarkus.oidc.client.runtime.TokensHelper` is a useful tool when OIDC client is used directly, without the OIDC client filter. To use `TokensHelper`, pass OIDC Client to it to get the tokens and `TokensHelper` acquires the tokens and refreshes them if necessary in a thread-safe way.
ja_jp: `io.quarkus.oidc.client.runtime.TokensHelper` は、OIDC クライアントフィルターを使用せずに OIDC クライアントを直接使用する場合に便利なツールです。 `TokensHelper` を使用するには、OIDC クライアントを渡してトークンを取得します。 `TokensHelper` はトークンを取得し、必要に応じてスレッドセーフな方法でトークンを更新します。

source: `io.quarkus.oidc.client.runtime.TokensHelper` manages the access token acquisition and refresh.
ja_jp: `io.quarkus.oidc.client.runtime.TokensHelper` は、アクセストークンの取得と更新を管理します。

source: `io.quarkus.opentelemetry.runtime.tracing.intrumentation.reactivemessaging.ReactiveMessagingTracingIncomingDecorator` (1000): Included with `quarkus-opentelemetry` extension, propagates tracing information
ja_jp: `io.quarkus.opentelemetry.runtime.tracing.intrumentation.reactivemessaging.ReactiveMessagingTracingIncomingDecorator` (1000): `quarkus-opentelemetry` エクステンションに含まれ、トレース情報を伝播します。

source: `io.quarkus.opentelemetry.runtime.tracing.intrumentation.reactivemessaging.ReactiveMessagingTracingOutgoingDecorator` (1000): Included with `quarkus-opentelemetry` extension, propagates tracing information
ja_jp: `io.quarkus.opentelemetry.runtime.tracing.intrumentation.reactivemessaging.ReactiveMessagingTracingOutgoingDecorator` (1000): `quarkus-opentelemetry` エクステンションに含まれ、トレース情報を伝播します。

source: `io.quarkus.platform:quarkus-bom:2.1.0.Final` - an equivalent of the `io.quarkus:quarkus-bom`;
ja_jp: `io.quarkus.platform:quarkus-bom:2.1.0.Final` - `io.quarkus:quarkus-bom` に相当するものです。

source: `io.quarkus.platform:quarkus-camel-bom:2.1.0.Final` - manages only the Camel Quarkus-related extensions and their required dependencies;
ja_jp: `io.quarkus.platform:quarkus-camel-bom:2.1.0.Final` - Camel Quarkus関連のエクステンションとその必要な依存関係のみを管理します。

source: `io.quarkus.platform:quarkus-kogito-bom:2.1.0.Final` - manages only the Kogito Quarkus-related extensions and their required dependencies;
ja_jp: `io.quarkus.platform:quarkus-kogito-bom:2.1.0.Final` - Kogito Quarkus関連のエクステンションとその必要な依存関係のみを管理します。

source: `io.quarkus.qute.UserTagSectionHelper.Arguments` metadata are accessible in a tag using the `_args` alias.
ja_jp: `io.quarkus.qute.UserTagSectionHelper.Arguments` メタデータは、`_args` エイリアスを使用してタグ内でアクセスできます。

source: `io.quarkus.redis.datasource.ReactiveRedisDataSource` - a reactive Redis data source returning `Uni<X>` or `Multi<X>`.
ja_jp: `io.quarkus.redis.datasource.ReactiveRedisDataSource`: `Uni<X>` または `Multi<X>` を返すリアクティブ型 Redis データソースです。

source: `io.quarkus.redis.datasource.RedisDataSource` - an imperative (blocking) Redis data source. Each operation blocks until a response is received or a timeout is reached
ja_jp: `io.quarkus.redis.datasource.RedisDataSource`: 命令型の (ブロッキング) Redis データソースです。各操作は、レスポンスを受信するか、タイムアウトに達するまでブロックされます。

source: `io.quarkus.runtime.configuration.MemorySize` to represent data sizes
ja_jp: データサイズを表す `io.quarkus.runtime.configuration.MemorySize`

source: `io.quarkus.smallrye.reactivemessaging.runtime.ConnectorContextPropagationDecorator` (-100): Clears the context propagation for incoming channels
ja_jp: `io.quarkus.smallrye.reactivemessaging.runtime.ConnectorContextPropagationDecorator` (-100): 着信チャネルのコンテキスト伝播をクリアします。

source: `io.quarkus.smallrye.reactivemessaging.runtime.ConnectorContextPropagationDecorator` (-100): Clears the context propagation for outgoing channels
ja_jp: `io.quarkus.smallrye.reactivemessaging.runtime.ConnectorContextPropagationDecorator` (-100): 発信チャネルのコンテキスト伝播をクリアします。

source: `io.quarkus.smallrye.reactivemessaging.runtime.RequestScopedDecorator` (100): Handles pausable channels
ja_jp: `io.quarkus.smallrye.reactivemessaging.runtime.RequestScopedDecorator` (100): 一時停止可能なチャネルを処理します。

source: `io.quarkus.test.infinispan.client.InfinispanTestResource` will start a single instance on port 11222 with user 'admin' and password 'password'.
ja_jp: `io.quarkus.test.infinispan.client.InfinispanTestResource` は、ポート 11222 で、ユーザー 'admin' とパスワード 'password' で単一のインスタンスを起動します。

source: `io.quarkus.test.mongodb.MongoReplicaSetTestResource` will start a replicaset with two instances, one on port 27017 and the other on port 27018.
ja_jp: `io.quarkus.test.mongodb.MongoReplicaSetTestResource` は、ポート27017とポート27018にある2つのインスタンスでレプリカセットを開始します。

source: `io.quarkus.test.mongodb.MongoTestResource` will start a single instance on port 27017.
ja_jp: `io.quarkus.test.mongodb.MongoTestResource` は、ポート27017に単一のインスタンスを起動します。

source: `io.quarkus.websockets.next.BinaryMessageCodec` for binary messages
ja_jp: バイナリーメッセージ用の `io.quarkus.websockets.next.BinaryMessageCodec`

source: `io.quarkus.websockets.next.TextMessageCodec` for text messages
ja_jp: テキストメッセージの `io.quarkus.websockets.next.TextMessageCodec`

source: `io.quarkus:quarkus-messaging-amqp` (extension)
ja_jp: `io.quarkus:quarkus-messaging-amqp` (エクステンション)

source: `io.quarkus:quarkus-messaging-kafka` (extension)
ja_jp: `io.quarkus:quarkus-messaging-kafka` (エクステンション)

source: `io.quarkus:quarkus-messaging-mqtt` (extension)
ja_jp: `io.quarkus:quarkus-messaging-mqtt` (エクステンション)

source: `io.quarkus:quarkus-security` module contains the core Quarkus Security classes.
ja_jp: `io.quarkus:quarkus-security` モジュールには、Quarkus Securityの中核となるクラスが含まれています。

source: `io.quarkus:quarkus-security` module contains the core Quarkus security classes.
ja_jp: `io.quarkus:quarkus-security` モジュールには、Quarkusの中核となるセキュリティクラスが含まれています。

source: `io.quarkus:quarkus-test-derby` for Derby
ja_jp: `io.quarkus:quarkus-test-derby` ダービーの場合

source: `io.quarkus:quarkus-test-h2` for H2
ja_jp: `io.quarkus:quarkus-test-h2` H2の場合

source: `io.smallrye.config.ConfigSourceFactory` priority does not affect the `ConfigSource` ordinal. These are sorted independently.
ja_jp: `io.smallrye.config.ConfigSourceFactory` の優先順位は、 `ConfigSource` の序列には影響しません。これらは独立してソートされます。

source: `io.smallrye.jwt.auth.principal.DefaultJWTCallerPrincipalFactory` is used by default to parse and verify JWT tokens and convert them to `JsonWebToken` principals. It uses `MP JWT` and `smallrye-jwt` properties listed in the `Configuration` section to verify and customize JWT tokens.
ja_jp: `io.smallrye.jwt.auth.principal.DefaultJWTCallerPrincipalFactory` は、デフォルトで JWT トークンを解析および検証し、それらを `JsonWebToken` プリンシパルに変換するために使用されます。設定セクションにリストされている `MP JWT` および `smallrye-jwt` プロパティーを使用して、JWT トークンを検証およびカスタマイズします。

source: `io.smallrye.jwt.util.KeyUtils` can also be used to generate a pair of assymetric RSA or EC keys. These keys can be stored using a `JWK`, `JWK Set` or `PEM` format.
ja_jp: `io.smallrye.jwt.util.KeyUtils` は、RSA鍵またはEC鍵のペアを生成するために使用することもできます。これらの鍵は、 `JWK`、 `JWK Set`、 `PEM` のフォーマットで保存することができます。

source: `io.smallrye.jwt.util.KeyUtils` can also be used to generate a pair of asymmetric RSA or EC keys. These keys can be stored using a `JWK`, `JWK Set` or `PEM` format.
ja_jp: `io.smallrye.jwt.util.KeyUtils` を使用して、非対称 RSA または EC キーのペアを生成することもできます。これらのキーは、 `JWK` 、 `JWK Set` 、または `PEM` 形式を使用して保存できます。

source: `io.smallrye.reactive.messaging.providers.IncomingInterceptorDecorator` (500): Handles `IncomingInterceptor` beans
ja_jp: `io.smallrye.reactive.messaging.providers.IncomingInterceptorDecorator` (500): `IncomingInterceptor` Bean を処理します。

source: `io.smallrye.reactive.messaging.providers.OutgoingInterceptorDecorator` (2000): Handles `OutgoingInterceptor` beans
ja_jp: `io.smallrye.reactive.messaging.providers.OutgoingInterceptorDecorator` (2000): `OutgoingInterceptor` Bean を処理します。

source: `io.smallrye.reactive.messaging.providers.extension.ObservationDecorator` (1000): Message observation support for incoming channels
ja_jp: `io.smallrye.reactive.messaging.providers.extension.ObservationDecorator` (1000): 着信チャネルのメッセージ監視サポート。

source: `io.smallrye.reactive.messaging.providers.extension.OutgoingObservationDecorator` (1000): Message observation support for outgoing channels
ja_jp: `io.smallrye.reactive.messaging.providers.extension.OutgoingObservationDecorator` (1000): 発信チャネルのメッセージ監視サポート。

source: `io.smallrye.reactive.messaging.providers.extension.PausableChannelDecorator` (1000): Handles pausable channels
ja_jp: `io.smallrye.reactive.messaging.providers.extension.PausableChannelDecorator` (1000): 一時停止可能なチャネルを処理します。

source: `io.smallrye.reactive.messaging.providers.locals.ContextDecorator` (0): Ensures messages are dispatched on the message context
ja_jp: `io.smallrye.reactive.messaging.providers.locals.ContextDecorator` (0): メッセージがメッセージコンテキストでディスパッチされることを保証します。

source: `io.smallrye.reactive.messaging.providers.metrics.MicrometerDecorator` (1000): Micrometer Metrics support, enabled with `quarkus-micrometer` extension
ja_jp: `io.smallrye.reactive.messaging.providers.metrics.MicrometerDecorator` (1000): `quarkus-micrometer` エクステンションで有効化される Micrometer Metrics サポート。

source: `io.vertx.core.Vertx` instance exposing the _bare_ Vert.x API
ja_jp: _素の_ Vert.x APIを公開する `io.vertx.core.Vertx` インスタンス

source: `io.vertx.core.buffer.Buffer` will be configured with `io.quarkus.pulsar.schema.BufferSchema` schema
ja_jp: `io.vertx.core.buffer.Buffer` は、 `io.quarkus.pulsar.schema.BufferSchema` スキーマで設定されます。

source: `io.vertx.core.json.JsonArray` will be configured with `io.quarkus.pulsar.schema.JsonArraySchema` schema
ja_jp: `io.vertx.core.json.JsonArray` は、 `io.quarkus.pulsar.schema.JsonArraySchema` スキーマで設定されます。
